I have this issue too:


**During apply:**

│ Error: Provider produced inconsistent result after apply
│ 
│ When applying changes to module.r1-eu-west-3.aws_route53profiles_resource_association.endpoints_phz["ssmmessages.profile-1"], provider "provider[\"registry.terraform.io/hashicorp/aws\"]" produced an unexpected new value: .resource_properties: was null, but now cty.StringVal("{\"ServiceName\":\"com.amazonaws.eu-west-3.ssmmessages.\",\"Z08346131UHY97ITQ7ZCD\":\"ssmmessages.eu-west-3.amazonaws.com.\"}").
│ 
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.

**And then when trying to plan:**

  # module.r1-eu-west-3.aws_route53profiles_resource_association.endpoints_phz["ssmmessages.profile-1"] is tainted, so must be replaced
-/+ resource "aws_route53profiles_resource_association" "endpoints_phz" {
      ~ id                  = "rpr-006d162b5948b9a493a" -> (known after apply)
        name                = "lzt-glb-ssmmessages-profile-1"
      ~ owner_id            = "767397755204" -> (known after apply)
      - resource_properties = jsonencode(
            {
              - ServiceName           = "com.amazonaws.eu-west-3.ssmmessages."
              - Z08346131UHY97ITQ7ZCD = "ssmmessages.eu-west-3.amazonaws.com."
            }
        ) -> null
      ~ resource_type       = "VPC_ENDPOINT" -> (known after apply)
      ~ status              = "COMPLETE" -> (known after apply)
      ~ status_message      = "Created Profile Resource Association" -> (known after apply)
        # (2 unchanged attributes hidden)
    }